InformationRegisters/DMS_АрхивРасчетовМинДатыПоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_АрхивРасчетовМинДатыПоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОтсчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НазваниеДаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокНаСкладе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПодготовки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальнаяДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЛокальноВДМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаАвтомобиль</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.DMS_ЗаявкаНаАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/DMS_АрхивРасчетовМинДатыПоставки/Ext/ManagerModule.bsl
// Создает запись в РС "Архив расчета минимальной даты поставки"
//
// Параметры:
//  ДанныеДляЗаписи - Структура.
//
Процедура СоздатьЗаписьРасчетаМинДатыПоставки(ДанныеДляЗаписи) Экспорт

	Если ТипЗнч(ДанныеДляЗаписи) = Тип("Структура") 
		И ДанныеДляЗаписи.Свойство("ЗаявкаНаАвтомобиль") И ЗначениеЗаполнено(ДанныеДляЗаписи.ЗаявкаНаАвтомобиль) Тогда
		
		МенеджерЗаписи = РегистрыСведений.DMS_АрхивРасчетовМинДатыПоставки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ЗаявкаНаАвтомобиль = ДанныеДляЗаписи.ЗаявкаНаАвтомобиль;
		МенеджерЗаписи.VIN                = ДанныеДляЗаписи.VIN;
		
		МенеджерЗаписи.Прочитать();
		
		Если НЕ МенеджерЗаписи.Выбран() Тогда
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеДляЗаписи);		

			Попытка
				МенеджерЗаписи.Записать();
			Исключение
				ЗаписьЖурналаРегистрации("Запись данных.Архив расчета минимальной даты поставки", УровеньЖурналаРегистрации.Ошибка,,, 
				"Возникла ошибка в обработке ""Ввод клиентов"", при создании записи в РС ""Архив расчета минимальной даты поставки""!" 
				+ Символы.ПС + ОписаниеОшибки());
			КонецПопытки;	
		КонецЕсли;	
	КонецЕсли;
		
КонецПроцедуры	

// Получить запись из РС "Архив расчета минимальной даты поставки"
//
// Параметры:
//  ЗаявкаНаАвтомобиль - Ссылка.
//  VIN - Строка (20).
//
Функция ПолучитьПараметрыРасчетаМинДатыПоставки(ЗаявкаНаАвтомобиль, VIN) Экспорт
	
	ПараметрыРасчета = Неопределено;
	
	Если ЗначениеЗаполнено(ЗаявкаНаАвтомобиль) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ 
		|	*
		|ИЗ
		|	РегистрСведений.DMS_АрхивРасчетовМинДатыПоставки КАК АрхивРасчетовМинДатыПоставки
		|ГДЕ
		|	АрхивРасчетовМинДатыПоставки.ЗаявкаНаАвтомобиль = &ЗаявкаНаАвтомобиль";
				
		Запрос.УстановитьПараметр("ЗаявкаНаАвтомобиль", ЗаявкаНаАвтомобиль);
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ПараметрыРасчета = Новый Структура;
			ПараметрыРасчета.Вставить("ЗаявкаНаАвтомобиль",      ЗаявкаНаАвтомобиль);
			ПараметрыРасчета.Вставить("VIN",                     "");
			ПараметрыРасчета.Вставить("ДатаОтсчета",             Дата(1,1,1));
			ПараметрыРасчета.Вставить("НазваниеДаты",            "");
			ПараметрыРасчета.Вставить("СрокДоставки",            0);
			ПараметрыРасчета.Вставить("СрокНаСкладе",            0);
			ПараметрыРасчета.Вставить("СрокПодготовки",          0);
			ПараметрыРасчета.Вставить("ОписаниеРасчета",         "");
			ПараметрыРасчета.Вставить("МинимальнаяДатаПоставки", Дата(1,1,1));
			ПараметрыРасчета.Вставить("ЛокальноВДМС", 			 Ложь);
			
			ЗаполнитьЗначенияСвойств(ПараметрыРасчета, Выборка);
		КонецЕсли;
	КонецЕсли;

	Возврат ПараметрыРасчета;
	
КонецФункции
